; domain
(define (domain pouring-manipulation)
  (:requirements :strips :typing)

  (:types
    robot item location
  )

  (:predicates
    (robot-at ?r - robot ?l - location)      ; robot's current symbolic location
    (obj-at ?i - item ?l - location)         ; item's current symbolic location (only when not held)
    (holding ?r - robot ?i - item)           ; robot is currently holding item ?i
    (gripper-empty ?r - robot)               ; robot's gripper is free
    (has-liquid ?i - item)                   ; item currently contains/holds liquid
  )

  ;; ---------------------------------------------------------
  ;; move: robot travels between two symbolic locations
  ;; ---------------------------------------------------------
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (robot-at ?r ?from)
    )
    :effect (and
      (not (robot-at ?r ?from))
      (robot-at ?r ?to)
    )
  )

  ;; ---------------------------------------------------------
  ;; grasp: robot picks up an item at its current location
  ;; ---------------------------------------------------------
  (:action grasp
    :parameters (?r - robot ?i - item ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (obj-at ?i ?l)
      (gripper-empty ?r)
    )
    :effect (and
      (holding ?r ?i)
      (not (obj-at ?i ?l))
      (not (gripper-empty ?r))
    )
  )

  ;; ---------------------------------------------------------
  ;; pour: robot, holding a filled item, pours its liquid
  ;;       into another item co-located with the robot
  ;; ---------------------------------------------------------
  (:action pour
    :parameters (?r - robot ?src - item ?dst - item ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (holding ?r ?src)
      (obj-at ?dst ?l)
      (has-liquid ?src)
    )
    :effect (and
      (has-liquid ?dst)
    )
  )

  ;; ---------------------------------------------------------
  ;; place: robot places the held item down at its current
  ;;        location and releases it (gripper becomes free)
  ;; ---------------------------------------------------------
  (:action place
    :parameters (?r - robot ?i - item ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (holding ?r ?i)
    )
    :effect (and
      (obj-at ?i ?l)
      (not (holding ?r ?i))
      (gripper-empty ?r)
    )
  )
)

; problem
(define (problem pour-bottle-into-cup)
  (:domain pouring-manipulation)

  (:objects
    robot1 - robot
    bottle cup - item
    loc-bottle loc-cup - location
  )

  (:init
    (robot-at robot1 loc-bottle)
    (obj-at bottle loc-bottle)
    (obj-at cup loc-cup)
    (gripper-empty robot1)
    (has-liquid bottle)
  )

  (:goal (and
    (has-liquid cup)
    (obj-at bottle loc-bottle)
    (gripper-empty robot1)
  ))
)

; plan
1. (grasp robot1 bottle loc-bottle)
   deleted: (obj-at bottle loc-bottle) (gripper-empty robot1)
   added: (holding robot1 bottle)
   goals met: 0 of 3
2. (move robot1 loc-bottle loc-cup)
   deleted: (robot-at robot1 loc-bottle)
   added: (robot-at robot1 loc-cup)
   goals met: 0 of 3
3. (pour robot1 bottle cup loc-cup)
   added: (has-liquid cup)
   goals met: 1 of 3
4. (move robot1 loc-cup loc-bottle)
   deleted: (robot-at robot1 loc-cup)
   added: (robot-at robot1 loc-bottle)
   goals met: 1 of 3
5. (place robot1 bottle loc-bottle)
   deleted: (holding robot1 bottle)
   added: (obj-at bottle loc-bottle) (gripper-empty robot1)
   goals met: 3 of 3
